Revit 2024 API
StairsPath.CreateOnMultistoryStairs Method
 Creates a new stairs path for the stairs in a multistory stairs with the specified stairs path type only in the plan view.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public static IList<StairsPath> CreateOnMultistoryStairs(
	Document document,
	LinkElementId multistoryStairsId,
	ElementId typeId
)
Visual Basic
Public Shared Function CreateOnMultistoryStairs ( _
	document As Document, _
	multistoryStairsId As LinkElementId, _
	typeId As ElementId _
) As IList(Of StairsPath)
Visual C++
public:
static IList<StairsPath^>^ CreateOnMultistoryStairs(
	Document^ document,
	LinkElementId^ multistoryStairsId,
	ElementId^ typeId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
multistoryStairsId
Type: Autodesk.Revit.DB.LinkElementId
 The id of the multistory stairs element either in the host document or in a linked document.
typeId
Type: Autodesk.Revit.DB.ElementId
 The type of stairs path.
Return Value
 The new stairs paths.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Cannot add more stairs paths on multistoryStairsId. -or- The typeId is not a valid stairs path type.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace